In [19]:
from models import Categories, Customers, Invoices, Products
from connection import dbsession


newCategories =[Categories(name="Smart phones"),Categories(name="Headsets"), Categories(name="Battery Chargers")]

newCustomer= Customers(fname="kiana", lname="kiazad", mobile="09120000006", email="kianakiazad74@gamil.com", password="1234", ncode=10, address="yazd,razmandegan ...")

# newProducts= [Products(name="iphone", price=22.5), Products(name="samsung", price=15.5)]



dbsession.add_all(newCategories)
dbsession.add(newCustomer)
# dbsession.add_all(newProducts)



# dbsession.commit()

In [20]:
# print("before:",newCustomer.id)
# dbsession.flush()
# print("after:",newCustomer.id)
# dbsession.commit()

In [21]:
try:
    dbsession.flush()
except Exception as e:
    print(e)
    
    dbsession.rollback()
    print("inja....")
else:
    dbsession.commit()
    print("all done")

all done

In [22]:
customers = dbsession.query(Customers).all()

customers

[<models.Customers at 0x103b82fb0>,
 <models.Customers at 0x104397070>,
 <models.Customers at 0x104397a30>,
 <models.Customers at 0x104fc3070>,
 <models.Customers at 0x116df6050>]

In [23]:
for customer in customers:
    print(customer.mobile, customer.fname, customer.id)

09120000000 kiana 1
09120000001 kiana 2
09120000002 kiana 3
09120000005 kiana 4
09120000006 kiana 5

In [24]:
import pandas as pd
customers = dbsession.query(Customers)
# print(customers.statement)


a = pd.read_sql(customers.statement, dbsession.connection())
a

,id,fname,lname,mobile,email,password,ncode,address
0,1,kiana,kiazad,09120000000,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
1,2,kiana,kiazad,09120000001,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
2,3,kiana,kiazad,09120000002,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
3,4,kiana,kiazad,09120000005,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
4,5,kiana,kiazad,09120000006,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."

In [25]:
a[a.mobile=="09120000002"]

,id,fname,lname,mobile,email,password,ncode,address
2,3,kiana,kiazad,09120000002,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."

In [26]:
a

,id,fname,lname,mobile,email,password,ncode,address
0,1,kiana,kiazad,09120000000,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
1,2,kiana,kiazad,09120000001,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
2,3,kiana,kiazad,09120000002,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
3,4,kiana,kiazad,09120000005,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."
4,5,kiana,kiazad,09120000006,kianakiazad74@gamil.com,1234,10,"yazd,razmandegan ..."

In [28]:
categories = dbsession.query(Categories).filter(Categories.id>=2)

pd.read_sql(categories.statement, dbsession.connection())

   id              name
0   2          Headsets
1   3  Battery Chargers